results/1/aj-Lenovo-G500s/Spock-0.7.9.0/DEEP.log
Benchmarking DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.16ms   75.40ms   1.92s    98.78%
    Req/Sec    13.69k     2.38k   25.14k    89.00%
  817874 requests in 30.04s, 116.22MB read
Requests/sec:  27227.59
Transfer/sec:      3.87MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.68ms   87.22ms   1.99s    98.65%
    Req/Sec    13.51k     2.78k   27.28k    88.83%
  806879 requests in 30.02s, 114.66MB read
  Socket errors: connect 0, read 0, write 0, timeout 111
Requests/sec:  26875.15
Transfer/sec:      3.82MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    40.28ms  110.95ms   2.00s    98.13%
    Req/Sec    13.82k     2.14k   23.74k    87.83%
  825507 requests in 30.03s, 117.30MB read
  Socket errors: connect 0, read 0, write 0, timeout 28
Requests/sec:  27490.74
Transfer/sec:      3.91MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.82ms   83.78ms   1.98s    98.60%
    Req/Sec    13.43k     1.97k   19.89k    77.17%
  801859 requests in 30.02s, 113.94MB read
  Socket errors: connect 0, read 0, write 0, timeout 96
Requests/sec:  26711.37
Transfer/sec:      3.80MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.71ms   83.78ms   2.00s    98.63%
    Req/Sec    13.87k     1.68k   20.96k    81.67%
  828209 requests in 30.02s, 117.69MB read
  Socket errors: connect 0, read 0, write 0, timeout 60
Requests/sec:  27588.41
Transfer/sec:      3.92MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    40.67ms  114.55ms   1.99s    98.10%
    Req/Sec    14.10k     3.21k   28.18k    87.10%
  826727 requests in 30.03s, 117.48MB read
  Socket errors: connect 0, read 0, write 0, timeout 31
Requests/sec:  27534.44
Transfer/sec:      3.91MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.07ms   83.14ms   1.97s    98.79%
    Req/Sec    13.77k     1.79k   22.13k    85.50%
  822184 requests in 30.03s, 116.83MB read
  Socket errors: connect 0, read 0, write 0, timeout 144
Requests/sec:  27382.87
Transfer/sec:      3.89MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.85ms   82.91ms   2.00s    98.74%
    Req/Sec    13.47k     1.19k   16.75k    68.83%
  804501 requests in 30.02s, 114.32MB read
  Socket errors: connect 0, read 0, write 0, timeout 133
Requests/sec:  26799.29
Transfer/sec:      3.81MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    36.37ms   92.08ms   1.99s    98.43%
    Req/Sec    13.98k     3.58k   28.79k    86.54%
  816795 requests in 30.03s, 116.06MB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:  27198.89
Transfer/sec:      3.86MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    36.98ms   92.40ms   2.00s    98.42%
    Req/Sec    13.68k     1.46k   19.76k    79.00%
  817259 requests in 30.02s, 116.13MB read
  Socket errors: connect 0, read 0, write 0, timeout 53
Requests/sec:  27222.66
Transfer/sec:      3.87MB
=================== summary ===================
machine:      aj-Lenovo-G500s
ghc version:  7.8.4
bench target: Spock-0.7.9.0
bench:        DEEP
bench mode:   30s * 10
average:      27203.14
stdev:        313.89
=================== oneline ===================
aj-Lenovo-G500s,7.8.4,Spock-0.7.9.0,DEEP,30s,10,27203.14,313.89